clc,clear

% 1,3位数据是时间，2,4位数据是流量
a = load("data54.txt");
t0 = a(:,[1,3]);    t0 = t0(:);     % 这两个是将向量化作一列
h0 = a(:,[2,4]);    h0 = h0(:);

E = 0.3024;     % 1E = 0.3024 m换算
D = 57*E;       % 直径
h = h0/100*E;   % 每一个高度
t = t0/3600;    % 换算为小时
V = pi/4*D^2*h; % 计算各个时刻的水体积

dv = gradient(V,t);     % 各个时间的水流量
no1 = find(h0 ==-1)     % 找出原始数据的无效值的地址，也就是泵水时
no2=[no1(1)-1:no1(2)+1,no1(3)-1:no1(4)+1] % 扩展一下找出导数数据的无效地址,这是特殊题型这样子做
tt=t;       tt(no2)=[]; % 删除导数数据无效地址对应的时间
dv2=-dv;    dv2(no2)=[]; % 给出各时刻的流速

%% 勾勒散点图
plot(tt,dv2,'*');
pp = csape(tt,dv2);     % 差值
tt0 = 0:0.1:tt(end);    % 插值数据
fdv = ppval(pp,tt0);    % 插值结果
hold on,plot(tt0,fdv)   % 绘制插值曲线
I=trapz(tt0(1:241),fdv(1:241)) % 计算24小时内总流量的数值积分