/* 信03 2351136 李盛鹏 */
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
/* ----具体要求----
   1、允许添加需要的头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数，但允许添加函数声明
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：LCM
  功    能：计算两数的最小公倍数
  输入参数：int m,n
  返 回 值：int
  说    明：
***************************************************************************/
int GCD();
int LCM(int m, int n)
{
	int gongbei;
	gongbei = m * n / GCD(m, n);
	return gongbei;
	
	/* 本函数内只允许一句return语句，且不得是逗号表达式 */
}

/***************************************************************************
  函数名称：GCD
  功    能：计算两数的最大公约数
  输入参数：int m,n
  返 回 值：int
  说    明：
***************************************************************************/
int GCD(int m, int n)
{
	int result=0;
		while(1){
			if (m > n) {
				result = m = m % n;
			}
			else {
				result = n = n % m;
			}
				if (result == 0) {
					break;
				}
		}
		if (m > n) {
			return m;
		}
		else {
			return n;
		}
	}


/***************************************************************************
  函数名称：get_int
  功    能：根据no值，打印“请输入出第no个正整数”,读到正整数后返回
  输入参数：int no
  返 回 值：int
  说    明：不准修改返回类型、形参
***************************************************************************/
int get_int(int no)
{
	int num;
	while (1) {
		printf("请输入第%d个正整数\n", no);
			int ret = scanf("%d", &num);

		if (ret == 1 && num > 0) {
			break;
		}

		if (ret == 0) {
			while ((getchar()) != '\n')
				;
		}//处理错误时候的情况 



	}
	return num;
}

/***************************************************************************
  函数名称：main
  功    能：调用函数
  输入参数：int m，n
  返 回 值：0
  说    明：只允许修改...部分
***************************************************************************/
int main()
{
	int m, n;

	/* 读入两个正整数 */
	m = get_int(1);
	n = get_int(2);

	/* 打印最大公约数和最小公倍数 */
	printf("最大公约数 : %d\n",GCD(m,n)); //将...补齐即可 
	printf("最小公倍数 : %d\n",LCM(m, n)); //将...补齐即可

	return 0;
}
