/*2351136 信03 李盛鹏*/
#include<iostream>
using namespace std;
int main()
{
	cout << "请输入找零值：" << endl;
	double a;
	cin >> a;
	int b = int(a * 100 + 0.001);

	int c = b / 5000;
	int d = (b % 5000) / 2000;
	int e = (b % 5000 % 2000) / 1000;
	int f = (b % 5000 % 2000 % 1000) / 500;
	int g = (b % 5000 % 2000 % 1000 % 500) / 100;
	int h = (b % 5000 % 2000 % 1000 % 500 % 100) / 50;
	int i = (b % 5000 % 2000 % 1000 % 500 % 100 % 50) / 10;
	int j = (b % 5000 % 2000 % 1000 % 500 % 100 % 50 % 10) / 5;
	int k = (b % 5000 % 2000 % 1000 % 500 % 100 % 50 % 10 % 5) / 2;
	int l = (b % 5000 % 2000 % 1000 % 500 % 100 % 50 % 10 % 5 % 2) / 1;//算出每个有多少张

	int m = c + d + e + f + g + h + i + j + k + l;
	cout << "共" << m << "张找零，具体如下：" << endl;//算出一共有多少张

	if (a >= 50) {
		cout << "50元 : " << c << "张" << endl;
		a -= c * 50;
	}
    if (a >= 20) {
		cout << "20元 : " << d << "张" << endl;
		a -= d * 20;
	}
    if (a >= 10) {
		cout << "10元 : " << e << "张" << endl;
		a -= e * 10;
	}
	if (a >= 5) {
		cout << "5元  : " << f << "张" << endl;
		a -= f * 5;
	}
    if (a >= 1) {
		cout << "1元  : " << g << "张" << endl;
		a -= g * 1;
	}
	if (a >= 0.5) {
		cout << "5角  : " << h << "张" << endl;
		a -= h * 0.5;
	}
	if (a >= 0.1) {
		cout << "1角  : " << i << "张" << endl;
		a -= i * 0.1;
	}
	if (a >= 0.05) {
		cout << "5分  : " << j << "张" << endl;
		a -= j * 0.05;
	}
	if (a >= 0.02) {
		cout << "2分  : " << k << "张" << endl;
		a -= k * 0.02;
	}
	if (a >= 0.01) {
		cout << "1分  : " << l << "张" << endl;
		a -= l * 0.01;
	}//表示最后的输出的张数
	return 0;
}