/* 信03 2351136 李盛鹏 */
#include "cmd_console_tools.h"
#include"hanoi.h"
using namespace std;

const int N = 10;
//圆柱上现有圆盘的编号
int A[N], B[N], C[N];
//三个全局指针
int topA = -1, topB = -1, topC = -1;
//总移动步数
int i = 0;
//一个速度动量
int i_speed;


/* ----------------------------------------------------------------------------------

	 本文件功能：
	1、放main函数
	2、初始化屏幕
	3、调用菜单函数（hanoi_menu.cpp中）并返回选项
	4、根据选项调用菜单各项对应的执行函数（hanoi_multiple_solutions.cpp中）

	 本文件要求：
	1、不允许定义全局变量（含外部全局和静态全局，const及#define不在限制范围内）
	2、静态局部变量的数量不限制，但使用准则也是：少用、慎用、能不用尽量不用
	3、按需加入系统头文件、自定义头文件、命名空间等

   ----------------------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：mian
	 功    能：初始化屏幕,调用菜单函数（hanoi_menu.cpp中）并返回选项,根据选项调用菜单各项对应的执行函数（hanoi_multiple_solutions.cpp中）
	 输入参数：
	 返 回 值：int 
	 说    明：
   ***************************************************************************/
int main()
{
    while (1) {

        /* demo中首先执行此句，将cmd窗口设置为40行x120列（缓冲区宽度120列，行数9000行，即cmd窗口右侧带有垂直滚动杆）*/
        cct_setconsoleborder(120, 40, 120, 9000);
        int choice = my_menu();
		if (choice == 0) {
			return 0;
		}
		main_case(choice);
        //回复原始状态的设置

        wait_for_enter();
		for (int count = 0; count < N; count++) {
			A[count] = 0;
			B[count] = 0;
			C[count] = 0;
		}
        i = 0;
    }
	return 0;
}