clc
clear all
% 定义目标函数的系数向量
f = [-0.75,-0.7753,-1.15,-1.3611,-1.9148,0.3750,0.4474,0.3500,0.5000,1.2304]; % 最小化

% 定义不等式约束矩阵和向量
A = [5,0,10,0,0,0,0,0,0,0;
    0,7,0,9,12,0,0,0,0,0;
    0,0,0,0,0,6,0,0,8,0;
    0,0,0,0,0,0,4,0,0,11;
    0,0,0,0,0,0,0,7,0,0]; % 不等式约束矩阵
b = [6000; 10000;4000;7000;4000]; % 不等式约束向量

% 定义变量的下界
lb = zeros(10,1);

Aeq = [1,1,0,0,0,-1,-1,-1,0,0;
       0,0,1,1,0,0,0,0,-1,0;
       0,0,0,0,1,0,0,0,0,-1];

beq = zeros(3,1);

% 使用 linprog 求解线性规划问题
[x, fval] = linprog(f, A, b, Aeq, beq, lb);

% 输出结果
disp('最优解 x:');
disp(x);
disp('目标函数最大值:');
disp(-fval);