clc
clear all
% 定义目标函数的系数向量
f = [repmat(-3100,1,3), repmat(-3800,1,3), repmat(-3500,1,3), repmat(-2850,1,3)]; % 最小化

% 定义不等式约束矩阵和向量
A = [repmat(1,1,3),repmat(0,1,9);
     repmat(0,1,3),repmat(1,1,3),repmat(0,1,6);
     repmat(0,1,6),repmat(1,1,3),repmat(0,1,3);
     repmat(0,1,9),repmat(1,1,3);
     1,repmat(0,1,2),1,repmat(0,1,2),1,repmat(0,1,2),1,repmat(0,1,2);
     0,1,repmat(0,1,2),1,repmat(0,1,2),1,repmat(0,1,2),1,0;
     repmat(0,1,2),1,repmat(0,1,2),1,repmat(0,1,2),1,repmat(0,1,2),1;
     480,repmat(0,1,2),650,repmat(0,1,2),580,repmat(0,1,2),390,repmat(0,1,2);
     0,480,repmat(0,1,2),650,repmat(0,1,2),580,repmat(0,1,2),390,0;
     repmat(0,1,2),480,repmat(0,1,2),650,repmat(0,1,2),580,repmat(0,1,2),390;
     ]; % 不等式约束矩阵
b = [18; 15;23;12;10;16;8;6800;8700;5300]; % 不等式约束向量

% 定义变量的下界
lb = zeros(12,1);

Aeq = [0.1,-0.0625,0,0.1,-0.0625,0,0.1,-0.0625,0,0.1,-0.0625,0;
       0.1,0,-0.125,0.1,0,-0.125,0.1,0,-0.125,0.1,0,-0.125;
       0,0.0625,-0.125,0,0.0625,-0.125,0,0.0625,-0.125,0,0.0625,-0.125];

beq = zeros(3,1);

% 使用 linprog 求解线性规划问题
[x, fval] = linprog(f, A, b, Aeq, beq, lb);

% 输出结果
disp('最优解 x:');
disp(x);
disp('目标函数最大值:');
disp(-fval);